Repository: arixbit/Arbor
Catalog: Arbor/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Merge rollback unavailable
zh_hans: 合并回滚不可用

source: Merge tool name
zh_hans: 合并工具名称

source: Merged
zh_hans: 已合并

source: Merged branch roots loaded
zh_hans: 已加载已合并分支仓库

source: Merged branches copied
zh_hans: 已复制已合并分支

source: Merged branches deleted
zh_hans: 已删除合并分支

source: Merged branches found
zh_hans: 已找到已合并分支

source: Merged Branches Report
zh_hans: 已合并分支报告

source: Merged branches report unavailable
zh_hans: 已合并分支报告不可用

source: Merged status
zh_hans: 合并状态

source: Merged status calculated for %@
zh_hans: 已计算 %@ 的合并状态

source: Message (optional)
zh_hans: 信息（可选）

source: Missing
zh_hans: 不存在

source: Missing upstream
zh_hans: 缺少 upstream

source: Modified
zh_hans: 修改

source: Modified line
zh_hans: 修改行

source: More Git Actions
zh_hans: 更多 Git 操作

source: More Log Actions
zh_hans: 更多日志操作

source: More tool windows
zh_hans: 更多工具窗

source: Move Left
zh_hans: 左移

source: Move Right
zh_hans: 右移

source: Move to Changelist
zh_hans: 移动到变更列表

source: Move to Shelf
zh_hans: 移动到 Shelf

source: Multi-root Interactive Rebase
zh_hans: 多仓库交互式 Rebase

source: Multi-root Merge Partially Completed
zh_hans: 多 root 合并部分完成

source: Multi-root Push failed
zh_hans: 多 root 推送失败

source: Multi-root Push partially completed
zh_hans: 多 root 推送部分完成

source: Multi-root Rebase Partially Completed
zh_hans: 多 root 变基部分完成

source: Narrower
zh_hans: 变窄

source: Native macOS Git workbench
zh_hans: 原生 macOS Git 工作台

source: needs resolution
zh_hans: 需要解决冲突

source: Nested commits
zh_hans: 嵌套提交

source: New branch
zh_hans: 新建分支

source: New Branch
zh_hans: 新建分支

source: New Branch from %@
zh_hans: 从 %@ 新建分支

source: New branch name
zh_hans: 新分支名称

source: New Branch…
zh_hans: 新建分支…

source: New Issue
zh_hans: 新建 Issue

source: New Pull Request
zh_hans: 新建 PR

source: New remote
zh_hans: 新远程

source: New Tag
zh_hans: 新建 Tag

source: New Tag…
zh_hans: 新建 Tag…

source: Next File
zh_hans: 下一个文件

source: No already unshelved shelves to clear
zh_hans: 没有可清理的已应用 Shelf

source: No branches
zh_hans: 没有分支

source: No changed files
zh_hans: 没有变更文件

source: No changes
zh_hans: 没有变更

source: No Changes
zh_hans: 没有变更

source: No changes in this dimension
zh_hans: 此维度没有变更

source: No commits
zh_hans: 没有提交

source: No commits match the command
zh_hans: 没有提交匹配该命令

source: No eligible repository contains a deletable copy of this branch.
zh_hans: 没有符合条件的仓库包含可删除的此分支副本。

source: No files
zh_hans: 没有文件

source: No Git root is available for this commit.
zh_hans: 没有可用于此次提交的 Git 根目录。

source: No Git Roots
zh_hans: 没有 Git 根目录

source: No GitHub remote configured
zh_hans: 未配置 GitHub 远程

source: No GitHub remote is configured.
zh_hans: 未配置 GitHub 远程。

source: No GitHub token is configured.
zh_hans: 未配置 GitHub Token。

source: No issues
zh_hans: 暂无 Issue

source: No local commits loaded
zh_hans: 未加载本地提交

source: No matching branches
zh_hans: 没有匹配的分支

source: No matching remote tags were found in the discovered repositories.
zh_hans: 发现的仓库中没有匹配的远程 Tag。

source: No merged branches
zh_hans: 没有已合并分支

source: No merged branches found
zh_hans: 未找到已合并分支

source: No Merges
zh_hans: 不显示合并提交

source: No nested commits available
zh_hans: 没有可用的嵌套提交

source: No patch details
zh_hans: 没有补丁详情

source: No patch files
zh_hans: 没有补丁文件

source: No prompt-based SSH authentication has succeeded yet.
zh_hans: 还没有基于提示的 SSH 认证成功记录。

source: No pull requests
zh_hans: 暂无 PR

source: No recent commit messages
zh_hans: 没有最近的提交信息

source: No recent messages
zh_hans: 没有最近提交信息

source: No Recent Projects
zh_hans: 没有最近项目

source: No remote branches
zh_hans: 没有远程分支

source: No remote-tracking branches
zh_hans: 没有远程跟踪分支

source: No remotes
zh_hans: 没有远程

source: No repositories loaded
zh_hans: 未加载仓库

source: No repository contains this local branch.
zh_hans: 没有仓库包含此本地分支。

source: No repository contains this remote branch.
zh_hans: 没有仓库包含此远程分支。

source: No repository contains this tag.
zh_hans: 没有仓库包含此标签。

source: No repository or user credential helpers are configured.
zh_hans: 未配置仓库级或用户级凭证助手。

source: No Shelved Changes
zh_hans: 没有 Shelf 变更

source: No shelves
zh_hans: 没有 Shelf

source: No signature
zh_hans: 无签名

source: No staged changes
zh_hans: 没有已暂存变更

source: No stashed changes
zh_hans: 没有 Stash 变更

source: No Submodule Changes
zh_hans: 没有子模块变化

source: No supported hosting remote is configured.
zh_hans: 没有配置受支持的托管远程仓库。

source: No token saved
zh_hans: 未保存 Token

source: No unmerged commits were found in the captured snapshot.
zh_hans: 捕获的快照中没有未合并提交。

source: Normalize on commit
zh_hans: 提交时规范化

source: Not calculated
zh_hans: 未计算

source: Not filtered
zh_hans: 尚未过滤

source: Not merged
zh_hans: 未合并

source: Nothing is staged. Commit all tracked changes?
zh_hans: 当前没有已暂存文件。提交全部已跟踪变更？

source: One helper per line. These values are stored in this repository's local Git config; leave empty to remove local overrides.
zh_hans: 每行一个凭证助手。这些值保存在当前仓库的本地 Git 配置中；留空可移除本地覆盖配置。

source: One or more protected branch patterns are invalid.
zh_hans: 一个或多个受保护分支匹配规则无效。

source: One regular expression per line. Force push is blocked for matching branches; main and master are protected by default.
zh_hans: 每行一个正则表达式。匹配的分支会阻止强制推送；默认保护 main 和 master。

source: Only selected paths are stashed. Untracked files are included; ignored files are excluded.
zh_hans: 只暂存选中的路径；会包含未跟踪文件，但不包含被忽略文件。

source: Only the local branch reference will be removed. Unmerged commits remain in the repository until garbage collection.
zh_hans: 只会删除本地分支引用。未合并的提交会保留在仓库中，直到垃圾回收。

source: Only the user@host and method are stored; credentials and SSH agent secrets are never saved here.
zh_hans: 这里只保存 user@host 和认证方式；凭证与 SSH agent 秘密不会保存在这里。

source: Only the version, system version, and a sanitized local log summary will be included.
zh_hans: 仅包含版本、系统版本和经过清理的本地日志摘要。

source: Onto
zh_hans: 变基到

source: Open
zh_hans: 打开

source: Open a Git project before changing project Git settings.
zh_hans: 请先打开 Git 项目，再修改项目 Git 设置。

source: Open another Log tab
zh_hans: 打开另一个日志标签页

source: Open Another Log Tab
zh_hans: 打开另一个日志标签页

source: Open branches
zh_hans: 打开分支

source: Open Branches
zh_hans: 打开分支

source: Open Browser
zh_hans: 在浏览器中打开

source: Open Git Roots
zh_hans: 打开 Git 根

source: Open Git SSH Settings
zh_hans: 打开 Git SSH 设置

source: Open Merge Revisions
zh_hans: 打开合并版本

source: Open Merge Revisions, resolve the files, then continue the operation.
zh_hans: 打开合并版本，解决文件后继续操作。

source: Open project
zh_hans: 打开项目

source: Open project failed
zh_hans: 打开项目失败

source: Open Project…
zh_hans: 打开项目…

source: Open Pull Requests
zh_hans: 打开 PR

source: Open Recent Project
zh_hans: 打开最近项目

source: Open Report
zh_hans: 打开报告

source: Open source failed
zh_hans: 打开源文件失败

source: Open source under the MIT License.
zh_hans: 基于 MIT 许可协议开源。

source: Open the Arbor source repository on GitHub
zh_hans: 在 GitHub 打开 Arbor 源代码仓库

source: Open the details button for the full error and suggested recovery.
zh_hans: 打开详情按钮查看完整错误和建议的恢复方式。

source: Open the details button for the full error, then retry after fixing the cause.
zh_hans: 打开详情按钮查看完整错误，修复原因后重试。

source: Open Verification Page
zh_hans: 打开验证页面

source: Open Worktree…
zh_hans: 打开 Worktree…

source: Operation interrupted
zh_hans: 操作在上次会话中断

source: Operation Log
zh_hans: 操作日志

source: Original message
zh_hans: 原始消息

source: Partial merge kept
zh_hans: 已保留部分合并结果

source: Partial stage
zh_hans: 逐部分暂存

source: Password / keyboard-interactive
zh_hans: 密码 / 键盘交互

source: Patch paths are written relative to this directory.
zh_hans: 补丁路径将相对于此目录写入。

source: Path to Git executable
zh_hans: Git 可执行文件路径

source: Platform
zh_hans: 平台

source: Preserve merge commits
zh_hans: 保留 merge 提交

source: Preserve merge topology: order is fixed; squash and fixup across merge control rows are unavailable.
zh_hans: 保留 merge 拓扑：顺序固定；跨 merge 控制行不可使用 squash 和 fixup。

source: Preview changes (尚未实现：变更预览需要统一的 diff 数据源，见 DIFF-001)
zh_hans: 预览变更（尚未实现：变更预览需要统一的 diff 数据源，见 DIFF-001）

source: Preview file diff
zh_hans: 预览文件差异

source: Previous File
zh_hans: 上一个文件

source: Project
zh_hans: 项目

source: Project Git Settings
zh_hans: 项目 Git 设置

source: Project Git Settings…
zh_hans: 项目 Git 设置…

source: Project opened
zh_hans: 项目已打开

source: Prune Deleted Branches
zh_hans: 清理已删除分支

source: Prune Remote Branches
zh_hans: 清理远程分支

source: Pull All (Merge)
zh_hans: 全部 Pull（Merge）

source: Pull All (Rebase)
zh_hans: 全部 Pull（Rebase）

source: Pull request #
zh_hans: PR 编号

source: Pull Requests
zh_hans: PR

source: Pull requests and issues are shown in the detail panel.
zh_hans: PR 和 Issue 显示在详情面板中。

source: Push All
zh_hans: 全部 Push

source: Push All Tags
zh_hans: 推送全部标签

source: Push rejected
zh_hans: 推送被拒绝

source: Push to Remote
zh_hans: 推送到远程

source: Push Up to Commit…
zh_hans: Push 到提交…

source: Push update failed
zh_hans: Push 更新失败

source: Push update paused for conflicts
zh_hans: Push 更新因冲突暂停

source: Rebase Current onto…
zh_hans: 将当前分支 Rebase 到…

source: Rebase from root
zh_hans: 从 root 变基

source: Recent commit messages
zh_hans: 最近的提交信息

source: Recent Filters
zh_hans: 最近筛选

source: Recently Deleted
zh_hans: 最近删除

source: recursive
zh_hans: 递归

source: Reference checked out
zh_hans: 已检出引用

source: Reflog actions
zh_hans: Reflog 操作

source: Refresh
zh_hans: 刷新

source: Refresh branches
zh_hans: 刷新分支

source: Refresh Changes
zh_hans: 刷新变更

source: Refresh failed
zh_hans: 刷新失败

source: Refresh log
zh_hans: 刷新日志

source: Refresh Log
zh_hans: 刷新日志

source: Refresh remote tags
zh_hans: 刷新远程 Tag

source: Refresh remote tags across repositories
zh_hans: 刷新所有仓库的远程 Tag

source: Refresh runs the read-only ssh-add -l probe. It never adds, removes, unlocks, or stores agent keys.
zh_hans: 刷新会运行只读的 ssh-add -l 探测，不会添加、删除、解锁或保存 agent 密钥。

source: Refresh the log or check the selected revision and filters.
zh_hans: 刷新日志，或检查选中的版本和过滤条件。

source: Regex
zh_hans: 正则表达式

source: Reject
zh_hans: 拒绝

source: REMOTE
zh_hans: 远程

source: Remote added
zh_hans: 远程已添加

source: REMOTE BRANCHES
zh_hans: 远程分支

source: Remote maintenance…
zh_hans: 远程维护…

source: Remote removed
zh_hans: 远程已移除

source: Remote tag deletion canceled; completed changes were kept.
zh_hans: 远程 Tag 删除已取消；已完成的更改已保留。

source: Remote tag operation canceled.
zh_hans: 远程 Tag 操作已取消。

source: Remote Tags
zh_hans: 远程 Tag

source: Remote Tags Across Repositories
zh_hans: 跨仓库远程 Tag

source: Remote Tags…
zh_hans: 远程 Tag…

source: Remote URL check failed
zh_hans: 远程 URL 检查失败

source: Remote URL check timed out.
zh_hans: 远程 URL 检查超时。

source: Remote URL check was cancelled.
zh_hans: 远程 URL 检查已取消。

source: Remotes…
zh_hans: 远程…

source: Remove
zh_hans: 移除

source: Remove Applied Files from Shelf
zh_hans: 从 Shelf 移除已应用文件

source: Remove remote?
zh_hans: 移除远程？

source: Rename
zh_hans: 重命名

source: Rename Branch
zh_hans: 重命名分支

source: Rename in Repositories…
zh_hans: 在多个仓库中重命名…

source: Rename Shelf
zh_hans: 重命名 Shelf

source: Rename…
zh_hans: 重命名…

source: Renamed
zh_hans: 重命名

source: Report a Problem…
zh_hans: 报告问题…

source: Repository
zh_hans: 仓库

source: Reset Column Order
zh_hans: 重置列顺序

source: Reset Column Widths
zh_hans: 重置列宽

source: Reset Current Branch to Here…
zh_hans: 将当前分支重置到此处…

source: Reset hard anyway
zh_hans: 仍然强制重置

source: Reset in all Git roots…
zh_hans: 在所有 Git 根目录重置…

source: Reset to PATH default
zh_hans: 恢复 PATH 默认值

source: Resize Commit and Project panels
zh_hans: 调整提交和项目面板大小

source: Resize left and right workspaces
zh_hans: 调整左右工作区大小

source: Resolve
zh_hans: 解决

source: Resolve Conflicts
zh_hans: 解决冲突

source: Resolve conflicts before continuing
zh_hans: 继续之前请先解决冲突

source: Resolve every conflicted file, then complete the shelf operation.
zh_hans: 解决所有冲突文件后，完成 Shelf 操作。

source: Resolve local changes
zh_hans: 解决本地变更

source: Resolve the files in this Git root, then continue the operation.
zh_hans: 解决此 Git 仓库中的文件冲突，然后继续操作。

source: Resolve the local restore in this Git root, then retry.
zh_hans: 解决此 Git 仓库中的本地变更恢复问题，然后重试。

source: Resolve the update error, then retry the root-scoped update.
zh_hans: 解决更新错误，然后重试此仓库的更新。

source: Resolve…
zh_hans: 解决…

source: RESOLVED
zh_hans: 已解决

source: Resolved by Git for this file
zh_hans: Git 对此文件解析出的结果

source: Resolving…
zh_hans: 正在解决…

source: Restore
zh_hans: 恢复

source: Restore All
zh_hans: 全部恢复

source: Restore branch
zh_hans: 恢复分支

source: Restore Branch
zh_hans: 恢复分支

source: Restore branch failed
zh_hans: 恢复分支失败

source: Restore from HEAD
zh_hans: 从 HEAD 恢复

source: Restore Selected
zh_hans: 恢复选中项

source: Restore tag
zh_hans: 恢复标签

source: Restore Tag
zh_hans: 恢复标签

source: Restore will recreate a lightweight tag at this target.
zh_hans: 恢复操作会在此目标上重新创建轻量标签。

source: Restore…
zh_hans: 恢复…

source: Retry
zh_hans: 重试

source: Retry Failed Checkout Roots
zh_hans: 重试失败的 Checkout 仓库

source: Retry Failed Push Roots
zh_hans: 重试失败的 Push 仓库

source: Retry Failed Roots
zh_hans: 重试失败仓库

source: Retry failed roots after correcting their Git configuration.
zh_hans: 修正 Git 配置后重试失败仓库。

source: Retry Push
zh_hans: 重试 Push

source: Retry Remaining Shelf Actions
zh_hans: 重试剩余 Shelf 操作

source: Retry Remaining Shelves
zh_hans: 重试剩余 Shelf

source: Retry unavailable
zh_hans: 重试不可用

source: Retry Update
zh_hans: 重试更新

source: rev1
zh_hans: 旧版本

source: rev2
zh_hans: 新版本

source: Revert
zh_hans: 撤销

source: Revert Changes
zh_hans: 撤销变更

source: Revert Commit
zh_hans: 还原提交

source: Revert Resolved
zh_hans: 撤销解决

source: Revert resolved conflict
zh_hans: 撤销已解决冲突

source: Revert Resolved failed
zh_hans: 撤销解决失败

source: Revert resolved file?
zh_hans: 撤销已解决文件？

source: Revert Selected Changes
zh_hans: 撤销选中的变更

source: Revert selected changes?
zh_hans: 撤销选中的变更？

source: Revert Selected Commits
zh_hans: 还原所选提交

source: Review Comment
zh_hans: Review 评论

source: Review local changes and patch applicability, then retry.
zh_hans: 检查本地变更和补丁是否可应用后重试。

source: Review the check output, then retry or choose the force action.
zh_hans: 检查任务输出后重试，或选择强制操作。

source: Review the host key fingerprint before accepting this connection.
zh_hans: 接受此连接前请检查主机密钥指纹。

source: Review the operation error before choosing how to continue.
zh_hans: 选择继续方式前，请先查看操作错误。

source: Review the successful repositories in Git Roots.
zh_hans: 请在 Git Roots 中检查成功的仓库。

source: Revision
zh_hans: 版本

source: Revision (empty = HEAD)
zh_hans: 版本（留空表示 HEAD）

source: Reword Commit
zh_hans: 改写提交信息

source: Reword Commit…
zh_hans: 改写提交信息…

source: reword message
zh_hans: 修改提交信息

source: Reword Selected Commits…
zh_hans: 改写所选提交…

source: Rewrite from the repository root
zh_hans: 从仓库根提交开始重写

source: Rewrite Initial Commit?
zh_hans: 改写初始提交？

source: Rewrite Selected Commit as Fixup…
zh_hans: 将选中提交改写为 Fixup…

source: Rewrite Selected Commit as Squash…
zh_hans: 将选中提交改写为 Squash…

source: Rewrite the selected files in this commit
zh_hans: 改写此提交中选中的文件变更

source: Rollback Merge
zh_hans: 回滚合并

source: Rollback only runs when a repository still has the expected HEAD; newer commits are never overwritten.
zh_hans: 仅当仓库仍处于预期 HEAD 时才会回滚；不会覆盖更新的提交。

source: Rollback Shelve Pop
zh_hans: 回滚 Shelve Pop

source: Rollback shelve restore
zh_hans: 回滚 Shelf 恢复

source: Rollback shelve restore failed
zh_hans: 回滚 Shelf 恢复失败

source: Rollback Successful Roots
zh_hans: 回滚成功的仓库

source: Rollback Unshelve
zh_hans: 回滚 Unshelve

source: Root Commit
zh_hans: 根提交

source: Root commit reword failed
zh_hans: 根提交改写失败

source: Root commit reworded
zh_hans: 根提交已改写

source: Root Names
zh_hans: 仓库名称

source: Root updated; retrying Push
zh_hans: 仓库已更新，正在重试 Push

source: Run
zh_hans: 运行

source: Run Checkout Tag or Revision again and enter a reference.
zh_hans: 重新运行“检出 Tag 或版本”并输入引用。

source: Run Fetch to update the local remote-tracking refs.
zh_hans: 运行 Fetch 以更新本地 remote-tracking 引用。

source: Run Find after changing the target or prefix
zh_hans: 修改目标分支或前缀后请重新查找

source: Run Find Merged Local Branches again.
zh_hans: 请重新运行查找已合并本地分支。

source: Run Find to calculate merged branches
zh_hans: 点击“查找”以计算已合并分支

source: Run Git's configured external merge tool
zh_hans: 运行 Git 配置的外部合并工具

source: Save Git executable
zh_hans: 保存 Git 可执行文件

source: Save local changes and retry
zh_hans: 保存本地更改并重试

source: Save SSH and credential settings failed
zh_hans: 保存 SSH 和凭证设置失败

source: Save Token
zh_hans: 保存 Token

source: Saved backup branches remain available for inspection or deletion.
zh_hans: 已保存的备份分支仍可查看或删除。

source: Saved to Keychain
zh_hans: 已保存到 Keychain

source: Search
zh_hans: 搜索

source: Search branches
zh_hans: 搜索分支

source: Search branches and actions
zh_hans: 搜索分支与动作

source: Search remote tags
zh_hans: 搜索远程 Tag

source: Select a branch or revision to merge into the current branch.
zh_hans: 选择要合并到当前分支的分支或版本。

source: Select a Change
zh_hans: 选择一个变更

source: Select a changed file to compare its three versions
zh_hans: 选择变更文件以比较三个版本

source: Select a changed file to preview its diff
zh_hans: 选择变更文件预览 Diff

source: Select a changed file to view its diff
zh_hans: 选择一个变更文件查看 diff

source: Select a conflicted file
zh_hans: 选择一个冲突文件

source: Select a file to inspect its root-scoped diff.
zh_hans: 选择文件查看对应 Git 根目录的 diff。

source: Select a file to inspect this revision
zh_hans: 选择文件查看此版本

source: Select a file to preview its diff
zh_hans: 选择文件以预览差异

source: Select a single-parent commit and retry.
zh_hans: 请选择只有一个父提交的版本后重试。

source: Select All
zh_hans: 全选

source: Select all visible branches
zh_hans: 选择所有可见分支

source: Select at least one repository
zh_hans: 至少选择一个仓库

source: Select files or folders from the Git roots
zh_hans: 从 Git 根目录选择文件或文件夹

source: Select Paths
zh_hans: 选择路径

source: Select Paths in Tree…
zh_hans: 在树中选择路径…

source: Select the Git executable used by Arbor's system Git operations.
zh_hans: 选择 Arbor 系统 Git 操作使用的 Git 可执行文件。

source: Select the Git roots whose staged changes should be committed.
zh_hans: 选择要提交已暂存变更的 Git 根目录。

source: Select this path
zh_hans: 选择此路径

source: set
zh_hans: 已设置

source: Set Branch
zh_hans: 设置分支

source: Set Upstream
zh_hans: 设置 upstream

source: Set Upstream…
zh_hans: 设置 upstream…

source: Settings
zh_hans: 设置

source: Settings…
zh_hans: 设置…

source: Shelf deletion undone
zh_hans: 已撤销 Shelf 删除

source: Shelf drop failed
zh_hans: Shelf 删除失败

source: Shelf name
zh_hans: Shelf 名称

source: Shelf rename failed
zh_hans: Shelf 重命名失败

source: Shelf renamed
zh_hans: Shelf 已重命名

source: Shelf view settings
zh_hans: Shelf 视图设置

source: Shelve — Resolve Conflicts
zh_hans: Shelve — 解决冲突

source: Shelve applied
zh_hans: 已应用 Shelf

source: Shelve Changes
zh_hans: Shelve 变更

source: Shelve dropped
zh_hans: 已丢弃 Shelf

source: Shelve pop completed
zh_hans: Shelve Pop 已完成

source: Shelve pop failed
zh_hans: Shelve Pop 失败

source: Shelve pop paused
zh_hans: Shelve Pop 已暂停

source: Shelve restore rolled back
zh_hans: Shelf 恢复已回滚

source: Shelves applied with warnings
zh_hans: Shelf 已应用但存在警告

source: Shelves dropped
zh_hans: 已删除 Shelf

source: Shelves unshelved
zh_hans: Shelf 已恢复

source: Shelves unshelved silently
zh_hans: Shelf 已静默恢复

source: Show Already Unshelved
zh_hans: 显示已应用 Shelf

source: Show Author
zh_hans: 显示作者

source: Show Author and Date
zh_hans: 显示作者和日期

source: Show Branches
zh_hans: 显示分支

source: Show Changes from Parents
zh_hans: 显示相对于父提交的变更

source: Show Commit Details
zh_hans: 显示提交详情

source: Show Commit Hash
zh_hans: 显示提交哈希

source: Show Commit Signature
zh_hans: 显示提交签名

source: Show Date
zh_hans: 显示日期

source: Show Diff
zh_hans: 显示 Diff

source: Show Diff Preview
zh_hans: 显示 Diff 预览

source: Show File at Revision
zh_hans: 显示该版本文件

source: Show File History
zh_hans: 显示文件历史

source: Show Git Log Command…
zh_hans: 显示 Git Log 命令…

source: Show History
zh_hans: 显示历史

source: Show History for Revision
zh_hans: 查看该版本的历史

source: Show Ignored
zh_hans: 显示已忽略文件

source: Show Long Edges
zh_hans: 显示长边

source: Show Only Affected Changes
zh_hans: 仅显示影响所选路径的变更

source: Show operation details
zh_hans: 显示操作详情

source: Show Recent Branches
zh_hans: 显示最近分支

source: Show Root Names
zh_hans: 显示仓库名称

source: Show Submodule Changes
zh_hans: 显示子模块变化

source: Show Tag Names
zh_hans: 显示标签名称

source: Side-by-side
zh_hans: 并排

source: Simplified Chinese
zh_hans: 简体中文

source: Since
zh_hans: 起始日期

source: Skip
zh_hans: 跳过

source: Skip hooks
zh_hans: 跳过 hooks

source: Some Shelves dropped
zh_hans: 部分 Shelf 已删除

source: Some shelves were not unshelved
zh_hans: 部分 Shelf 未恢复

source: Sort
zh_hans: 排序

source: Source file unavailable
zh_hans: 源文件不可用

source: Source revision
zh_hans: 源版本

source: Squash Commits
zh_hans: 压缩提交

source: Squash Selected Commits…
zh_hans: 压缩选中的提交…

source: SSH agent diagnostics are not loaded.
zh_hans: 尚未加载 SSH agent 诊断结果。

source: SSH agent is not configured
zh_hans: 未配置 SSH agent

source: SSH agent is not reachable
zh_hans: 无法连接 SSH agent

source: SSH agent is reachable, but has no identities
zh_hans: SSH agent 可连接，但没有身份密钥

source: SSH agent is ready
zh_hans: SSH agent 已就绪

source: SSH agent probe failed
zh_hans: SSH agent 探测失败

source: SSH and credential settings saved
zh_hans: SSH 和凭证设置已保存

source: SSH host
zh_hans: SSH 主机

source: SSH Host Key Verification
zh_hans: SSH 主机密钥验证

source: SSH host key verification is required.
zh_hans: 需要验证 SSH 主机密钥。

source: SSH key only
zh_hans: 仅 SSH 密钥

source: SSH Settings…
zh_hans: SSH 设置…

source: Stage
zh_hans: 暂存

source: Stage All
zh_hans: 暂存全部

source: Stage all changes
zh_hans: 暂存全部变更

source: Stage all changes failed
zh_hans: 暂存全部变更失败

source: Stage changes
zh_hans: 暂存已跟踪变更

source: Stage changes failed
zh_hans: 暂存变更失败

source: Stage or unstage all changes in this Git root
zh_hans: 暂存或取消暂存此 Git 根目录中的全部变更

source: Stage or unstage this file
zh_hans: 暂存或取消暂存此文件

source: Stage this file
zh_hans: 暂存此文件

source: Stage untracked without content
zh_hans: 暂存未跟踪文件但不写入内容

source: Stage view settings
zh_hans: 暂存视图设置

source: Stage Without Content
zh_hans: 暂存但不写入内容

source: Stage-and-Retry
zh_hans: 暂存并重试

source: Staged
zh_hans: 已暂存

source: Staged Files
zh_hans: 已暂存文件

source: Start Device Sign-in
zh_hans: 开始设备登录

source: Start Rebase
zh_hans: 开始 Rebase

source: Stash applied
zh_hans: 已应用 stash

source: Stash Changes
zh_hans: Stash 变更

source: Stash dropped
zh_hans: 已丢弃 stash

source: Stash Selected Files
zh_hans: 暂存选中的文件

source: Stash Selected Files…
zh_hans: 暂存选中的文件…

source: State
zh_hans: 状态

source: Status
zh_hans: 状态

source: Status refreshed
zh_hans: 状态已刷新

source: Stored as this repository's core.sshCommand. Leave it empty to use the default SSH configuration.
zh_hans: 保存为此仓库的 core.sshCommand。留空则使用默认 SSH 配置。

source: Strict (recommended)
zh_hans: 严格（推荐）

source: Strict rejects unknown or changed host keys; Accept new keys records a first-seen key; Do not verify disables host-key protection.
zh_hans: 严格模式拒绝未知或已变更的主机密钥；接受新密钥会记录首次看到的密钥；不验证会关闭主机密钥保护。

source: Strict rejects unknown or changed host keys; Ask before trusting shows the host fingerprint; Accept new keys records a first-seen key; Do not verify disables host-key protection.
zh_hans: 严格模式拒绝未知或已变更的主机密钥；信任前询问会显示主机指纹；接受新密钥会记录首次看到的密钥；不验证会关闭主机密钥保护。

source: Structured diff unavailable
zh_hans: 结构化差异不可用

source: Submit Comment
zh_hans: 提交评论

source: Submodule add canceled
zh_hans: 子模块添加已取消

source: Submodule add failed
zh_hans: 子模块添加失败

source: Submodule change unavailable
zh_hans: 子模块变化不可用

source: Submodule Changes
zh_hans: 子模块变化

source: Submodule deinit canceled
zh_hans: 子模块反初始化已取消

source: Submodule deinitialized
zh_hans: 子模块已反初始化

source: Submodule gitlink
zh_hans: 子模块 gitlink

source: Submodule is not initialized
zh_hans: 子模块未初始化

source: Submodule Log
zh_hans: 子模块日志

source: Submodule removal canceled
zh_hans: 子模块移除已取消

source: Submodule removal failed
zh_hans: 子模块移除失败

source: Submodule sync canceled
zh_hans: 子模块同步已取消

source: Submodule sync failed
zh_hans: 子模块同步失败

source: Submodule update canceled
zh_hans: 子模块更新已取消

source: Submodule update failed
zh_hans: 子模块更新失败

source: Submodules
zh_hans: 子模块

source: Submodules updated
zh_hans: 子模块已更新

source: Successful repositories
zh_hans: 成功的仓库
